app/views/articles/show.html.erb


<% if @article.comments.first != nil %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ?  ORDER BY "comments"."id" ASC LIMIT 1  [["article_id", 10]]