app/controllers/articles_controller.rb

  def create
    # render plain: params[:article].inspect
    # The render method here is taking a very simple hash with a key of plain and value
    # of params[:article].inspect. The params method is the object  which represents the
    # parameters coming in from the form The params method returns an
    # ActiveSupport::HashWithIndefferentAccess

    # When the form is submitted, it comes with the values filled in, which includes
    # :title and :text

    # @article = Article.new(params[:article])
    @article = Article.new(article_params)
    # Require permission for certain parameters for this object.

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hye there"], ["text", "This is my first article!"], ["created_at", "2015-11-02 05:18:50.701662"], ["updated_at", "2015-11-02 05:18:50.701662"]]