app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Leon"], ["body", "Hey I am the first commenter!"], ["article_id", 1], ["created_at", "2015-11-02 05:23:12.586056"], ["updated_at", "2015-11-02 05:23:12.586056"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)